@echo off

::-------------------------------------
:: ->->->->- 调用显示空格函数 -<-<-<-<-
::-------------------------------------
::
call :EchoNSpace %1
rem goto :eof
exit /b

::--------------------------------------
:: ->->->->- 获取退格符 函数 -<-<-<-<-
::--------------------------------------
:GetBackSpace
for /f %%a in ('"prompt $h & for %%b in (1) do rem"')do Set "%1=%%a"
goto :eof

::--------------------------------------
:: ->->->->- 显示 n 个空格 函数 -<-<-<-<-
::--------------------------------------
:EchoNSpace
:: -- 获取退格符
call :GetBackSpace bs
:: -- (1,1,%1)第一个1表示从1开始，第二个1表示递增值为1，%1表示最大值
for /l %%i in (1,1,%1) do (
    set /p =a%bs% < nul
)
goto :eof

