@echo off

::----------------------------------
:: ->->->->- 创建颜色文件 -<-<-<-<-
::----------------------------------
::
call:putcstart

::----------------------------------
:: ->->->->- 显示颜色文件 -<-<-<-<-
::----------------------------------
::
:: -- %2参数请在cmd键入“help color”
call:putcchar %1 %2

rem pause>nul
rem goto :eof
exit /b

::--------------------------------------
:: ->->->->- 创建颜色文件函数 -<-<-<-<-
::--------------------------------------
::
:putcstart
rem set crp=c:\
set crp=.\
set crf=crfile.tmp
set /p=   <nul>%crp%%crf%
goto :eof

::--------------------------------------
:: ->->->->- 显示颜色文件函数 -<-<-<-<-
::--------------------------------------
::
:putcchar
ren %crp%%crf% %1
rem pushd .&C:&cd\
findstr /a:%2 . %1?
del %1
rem ren %crp%%1 %crf%
rem popd
goto :eof
